# one-hot encoding

is a technique used to convert categorical data into a binary (0/1) representation for each category.

This is typically used when the categories have no natural order, and you want to create binary flags to indicate the presence or absence of each category

In [1]:
#import paskages
import pandas as pd

In [2]:
#data sample
data = {'Borough': ['Manhattan', 'Queens', 'Manhattan', 'Brooklyn', 'Brooklyn', 'Bronx'],
        'Salary': [103, 89, 142, 54, 63, 219]}

# Create a DataFrame
df = pd.DataFrame(data)
df

     Borough  Salary
0  Manhattan     103
1     Queens      89
2  Manhattan     142
3   Brooklyn      54
4   Brooklyn      63
5      Bronx     219

In [7]:
# one-hot encoding
encoded_df = pd.get_dummies(df , columns=['Borough'] ,prefix='Borough') #function is used to add a prefix to the new column names created during one-hot encoding. 
encoded_df

   Salary  Borough_Bronx  Borough_Brooklyn  Borough_Manhattan  Borough_Queens
0     103              0                 0                  1               0
1      89              0                 0                  0               1
2     142              0                 0                  1               0
3      54              0                 1                  0               0
4      63              0                 1                  0               0
5     219              1                 0                  0               0